app/Controllers/CustomerController.php

SELECT *
FROM `bookings`
WHERE `customer_email` = 'gabe@gmail.com'
---
    public function userDashboard() // If user_role = User, it will show the following - eiryk
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/'); // Redirects the User if they're not Logged In
        }

        // Uses the WorkerModel to Retrieve Workers
        $workerModel = new WorkerModel();
        $data['workers'] = $workerModel->getWorkers(); // Retrieves the Workers from the Database

        //Similar to the workerDashboard() function, retrieves the data from database base on customer email
        $bookingModel = new BookingModel();
        $data['bookings'] = $bookingModel->where('customer_email', session()->get('email'))->findAll();