app/Controllers/CustomerController.php

    public function receipts() // Shows the Receipt from the User and Calendar Files - eiryk
    {
        $data = $this->request->getPost();

        $data = [
            'selectedDate' => $this->request->getPost('selectedDate'),
            'selectedTime' => $this->request->getPost('selectedTime'),
            'worker_id' => $this->request->getPost('workerId'), // Captures the Worker Name
            'workerName' => $this->request->getPost('workerName'),
        ];

        //Saving the receipt/booking to the database to display sa worker dashboard
        $bookingModel = new BookingModel();
        $bookingModel->save([

            'customer_id' => session()->get('id'),
            'worker_id' => $data['worker_id'],
            'date_selected' => $data['selectedDate'],
            'time_selected' => $data['selectedTime'],
            'time_of_booking' => date('Y-m-d H:i:s'),

        ]
    );
---
INSERT INTO `bookings` (`customer_id`, `worker_id`, `date_selected`, `time_selected`, `time_of_booking`) VALUES ('14', '9', '2024-11-10', '01:00 PM', '2024-11-09 20:17:22')