app/Controllers/HeadAdminController.php

    public function index()
    {
        $role_filter = $this->request->getGet('role_filter') ?? 'all';
        $userModel = new UserModel();

        if ($role_filter === 'all') {
            $accounts = $userModel->findAll();
        } else {
            $accounts = $userModel->where('user_role', $role_filter)->findAll();
---
SELECT *
FROM `users`
SELECT *
FROM `users`
WHERE `user_role` = 'user'

    public function edit($id)
{
    $userModel = new UserModel();
    $account = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '6'