app/Models/BookingModel.php

    public function getWorkerBookings($workerId) {
        return $this->select('bookings.*,
                            customer.name as customer_name,
                            customer.email as customer_email')
                    ->join('users as customer', 'customer.id = bookings.customer_id')
                    ->where('worker_id', $workerId)
                    ->findAll();
---
SELECT `bookings`.*, `customer`.`name` as `customer_name`, `customer`.`email` as `customer_email`
FROM `bookings`
JOIN `users` as `customer` ON `customer`.`id` = `bookings`.`customer_id`
WHERE `worker_id` = '7'